app/controllers/reviews_controller.rb

  def create
	@product = Product.find(params[:product_id])
	@review = @product.reviews.create(review_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("body", "rating", "timeCreated", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "hello"], ["rating", 5.0], ["timeCreated", "2015-04-20 23:09:00.000000"], ["product_id", 2], ["created_at", "2015-04-20 23:09:54.369059"], ["updated_at", "2015-04-20 23:09:54.369059"]]

  def destroy
    @review.destroy
    respond_to do |format|
      format.html { redirect_to product_path(Product.find(params[:product_id])), notice: 'Review was successfully destroyed.' }
---
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 4]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 4]]