app/controllers/welcome_controller.rb

SELECT  products.id, products.name, products.description, avg(reviews.rating) as average_rating, products.price FROM "products" INNER JOIN "reviews" ON "reviews"."product_id" = "products"."id" GROUP BY products.id  ORDER BY avg(reviews.rating) LIMIT 10
---
  def index
    @products = Product.joins(:reviews).select("products.id, products.name, products.description, avg(reviews.rating) as average_rating, products.price").
						group("products.id").limit(10).order("average_rating DESC")