app/views/reviews/_review.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
---
<% if review.id != nil and review.author_id != nil %>
<% author = User.find(review.author_id) %>